app/Controllers/Auth.php

INSERT INTO `users` (`username`, `password_hash`, `created_at`, `updated_at`) VALUES ('sam', '$2y$10$dxQUfYMI7hC3KbFrHuyuyOJV2zApWrYaasNhnd2DbqL0PwlEl4Hp6', '2025-10-28 13:11:48', '2025-10-28 13:11:48')
---
    public function register(): RedirectResponse
    {
        $username = (string) $this->request->getPost('username');
        $password = (string) $this->request->getPost('password');
        $confirm  = (string) $this->request->getPost('password_confirm');

        if ($password !== $confirm) {
            return redirect()->back()->withInput()->with('errors', ['password' => 'Passwords do not match.']);
        }

        $userModel = new UserModel();
        $data = [
            'username'      => $username,
            'password_hash' => password_hash($password, PASSWORD_DEFAULT),
        ];

        if (! $userModel->save($data)) {

SELECT *
FROM `users`
WHERE `username` = 'sam'
 LIMIT 1
---
    public function login(): RedirectResponse
    {
        $username = (string) $this->request->getPost('username');
        $password = (string) $this->request->getPost('password');

    $userModel = new UserModel();
    $user      = $userModel->where('username', $username)->first();