app/Controllers/Notes.php

SELECT *
FROM `notes`
ORDER BY `created_at` DESC
---
    public function index(): string
    {
        $model = new NoteModel();
        $notes = $model->orderBy('created_at', 'DESC')->findAll();

INSERT INTO `notes` (`title`, `content`, `created_at`, `updated_at`) VALUES ('Welcome', 'Hello! ', '2025-10-28 13:13:00', '2025-10-28 13:13:00')
---
    public function store(): RedirectResponse
    {
        $model = new NoteModel();

        $data = [
            'title'   => $this->request->getPost('title'),
            'content' => $this->request->getPost('content'),
        ];

        if (! $model->save($data)) {

DELETE FROM `notes`
WHERE `id` IN (3)
---
    public function delete(int $id): RedirectResponse
    {
        $model = new NoteModel();
        $model->delete($id);